# -*- fill-column: 69; org-confirm-babel-evaluate: nil -*-
#+STARTUP: align entitiespretty hidestars inlineimages latexpreview noindent showall
#+OPTIONS: prop:nil title:t toc:t \n:nil ::t |:t ^:{} -:t *:t ':nil

#+TITLE: YANG Data Model for the IS-IS Reverse Metric Extension
#+AUTHOR: Christian Hopps
#+EMAIL: chopps@chopps.org
#+AFFILIATION: LabN Consulting, L.L.C.
#+RFC_NAME: draft-hopps-lsr-yang-isis-reverse-metric
#+RFC_VERSION: 02
#+RFC_XML_VERSION: 3

#+begin_abstract
This document defines a YANG module for managing the reverse metric
extension to the the intermediate system to intermediate system
routeing protocol.
#+end_abstract

* Introduction

This document defines a YANG module for managing the reverse metric
extension to the intermediate system to intermediate system routeing
protocol (IS-IS) [[RFC8500]], [[ISO10589]]. Please refer to [[RFC8500]] for the
description and definition of the functionality managed by this
module.

The YANG data model described in this document conforms to the
Network Management Datastore Architecture defined in [[RFC8342]].

* YANG Management
** YANG Tree

The following is the YANG tree diagram ([[RFC8340]]) for the IS-IS
reverse metric extension additions.

#+name: IS-IS Reverse Metric YANG tree diagram.
#+begin_src shell :var file=ietf-isis-reverse-metric :results output verbatim replace :wrap example :exports results
pyang --tree-line-length=69 -f tree ${file}
#+end_src

#+RESULTS: IS-IS Reverse Metric YANG tree diagram.
#+begin_example

module: ietf-isis-reverse-metric
  augment /rt:routing/rt:control-plane-protocols
            /rt:control-plane-protocol/isis:isis/isis:interfaces
            /isis:interface:
    +--rw reverse-metric
       +--rw reverse-metric
       |  +--rw metric?   isis:wide-metric
       |  +--rw flags?    bits
       +--rw exclude-te-metric?   boolean
  augment /rt:routing/rt:control-plane-protocols
            /rt:control-plane-protocol/isis:isis/isis:interfaces
            /isis:interface/isis:adjacencies/isis:adjacency:
    +--ro reverse-metric
    |  +--ro metric?   isis:wide-metric
    |  +--ro flags?    bits
    +--ro te-metric?        uint32
#+end_example

** YANG Module

The following is the YANG module for managing the IS-IS reverse metric
functionality defined in [[RFC8500]].

#+NAME: test-validate-module
#+HEADER: :var module=ietf-isis-reverse-metric
#+begin_src bash :results output verbatim replace :wrap example :exports none
unset YANG_MODPATH
if ! pyang -Werror --ietf $module 2>&1; then echo FAIL; fi
#+end_src

#+RESULTS: validate-module
#+begin_example
#+end_example

#+name: ietf-isis-reverse-metric
#+header: :cmdline "-fyang --yang-canonical"
#+header: :var dep1=dep-babel :var dep2=fetch-yang-files :file ietf-isis-reverse-metric.yang :results output code silent
#+begin_src yang :exports code
  module ietf-isis-reverse-metric {
    yang-version 1.1;
    namespace "urn:ietf:params:xml:ns:yang:ietf-isis-reverse-metric";
    prefix isis-rmetric;

    import ietf-isis { prefix isis; }
    import ietf-routing { prefix "rt"; }

    organization
      "IETF NETMOD Working Group (NETMOD)";
    contact
      "WG Web:  <https://tools.ietf.org/wg/netmod/>
       WG List: <mailto:netmod@ietf.org>

       Author: Christian Hopps
               <mailto:chopps@chopps.org>";

    // RFC Ed.: replace XXXX with actual RFC number and
    // remove this note.

    description
      "This module defines the configuration and operational state for
       managing the IS-IS reverse metric functionality [RFC8500].

       Copyright (c) 2019 IETF Trust and the persons identified as
       authors of the code. All rights reserved.

       Redistribution and use in source and binary forms, with or
       without modification, is permitted pursuant to, and subject to
       the license terms contained in, the Simplified BSD License set
       forth in Section 4.c of the IETF Trust's Legal Provisions
       Relating to IETF Documents
       (https://trustee.ietf.org/license-info).

       This version of this YANG module is part of RFC XXXX
       (https://tools.ietf.org/html/rfcXXXX); see the RFC itself for
       full legal notices.";

    revision 2019-03-31 {
      description "Initial Revision";
      reference "RFC XXXX: YANG IS-IS Reverse Metric";
    }

    grouping reverse-metric-data {
      description "IS-IS reverse metric data.";
      container reverse-metric {
        description "IS-IS reverse metric data.";
        leaf metric {
          type isis:wide-metric;
          description "The reverse metric value.";
        }
        leaf flags {
          type bits {
            bit whole-lan {
              position 0;
              description
                "The 'whole LAN' or W-bit. If true then a DIS
                 processing this reverse metric will add the metric
                 value to all the nodes it advertises in the
                 pseudo-node LSP for this interface. Otherwise it will
                 only increment the metric for the advertising node in
                 the pseudo-node LSP for this interface.";
            }
            bit allow-unreachable {
              position 1;
              description
                "The 'allow-unreachable' or U-bit. If true it allows
                 the neighbor to increment the overall metric up to
                 2^24-1 rather than the lesser maximum of 2^24-2, and
                 if done will cause traffic to stop using rather than
                 avoid using the interface.";
            }
          }
          description "The reverse metric flag values.";
        }
      }
    }

    grouping tlv16-reverse-metric {
      description "IS-IS reverse metric TLV data.";
      uses reverse-metric-data;
      leaf te-metric {
        type uint32;
        description "The TE metric value from the sub-TLV if present.";
      }
    }

    augment "/rt:routing/rt:control-plane-protocols/"
      +"rt:control-plane-protocol/"
      +"isis:isis/isis:interfaces/isis:interface" {
      when "../../../rt:type = 'isis:isis'" {
        description
          "This augment is only valid when routing protocol instance
           type is 'isis'.";
      }

      description
        "The reverse metric configuration for an interface.";

      container reverse-metric {
        description "Announce a reverse metric to neighbors.";
        uses reverse-metric-data;
        leaf exclude-te-metric {
          type boolean;
          default false;
          description
            "If true and there is a TE metric defined for this
             interface then do not send the TE metric sub-TLV in the
             reverse metric TLV.";
        }
      }
    }
    augment "/rt:routing/rt:control-plane-protocols/"
      +"rt:control-plane-protocol/"
      +"isis:isis/isis:interfaces/isis:interface/"
      +"isis:adjacencies/isis:adjacency" {
      when "../../../../../rt:type = 'isis:isis'" {
        description
          "This augment is only valid when routing protocol instance
           type is 'isis'";
      }

      description
        "The reverse metric state advertised by a neighbor.";
      uses tlv16-reverse-metric;
    }
  }
#+end_src

* IANA Considerations

** Updates to the IETF XML Registry

This document registers a URI in the "IETF XML Registry" [[RFC3688]].
Following the format in [[RFC3688]], the following registration has been
made:

- URI :: urn:ietf:params:xml:ns:yang:ietf-isis-reverse-metric
- Registrant Contact :: The IESG.
- XML :: N/A; the requested URI is an XML namespace.

** Updates to the YANG Module Names Registry

This document registers one YANG module in the "YANG Module Names"
registry [[RFC6020]]. Following the format in [[RFC6020]], the following
registration has been made:

- name :: ietf-isis-reverse-metric
- namespace :: urn:ietf:params:xml:ns:yang:ietf-isis-reverse-metric
- prefix :: isis-rmetric
- reference :: RFC XXXX (RFC Ed.: replace XXX with actual RFC number and remove this note.)

* Security Considerations

The YANG module specified in this document defines a schema for data
that is designed to be accessed via network management protocols such
as NETCONF [[RFC6241]] or RESTCONF [[RFC8040]]. The lowest NETCONF layer is
the secure transport layer, and the mandatory-to-implement secure
transport is Secure Shell (SSH) [[RFC6242]]. The lowest RESTCONF layer is
HTTPS, and the mandatory-to-implement secure transport is TLS
[[RFC8446]].

The Network Configuration Access Control Model (NACM) [[RFC8341]]
provides the means to restrict access for particular NETCONF or
RESTCONF users to a preconfigured subset of all available NETCONF or
RESTCONF protocol operations and content.

The YANG module defined in this document can enable, disable and
modify the behavior of metrics used by routing. For the security
implications regarding these types of changes consult the [[RFC8500]]
which defines the functionality.

* Normative References
** ISO10589
   :PROPERTIES:
   :REF_URLXML: http://xml2rfc.ietf.org/public/rfc/bibxml-misc/reference.ISO.10589.1992.xml
   :END:
** RFC3688
** RFC6020
** RFC6241
** RFC6242
** RFC8040
** RFC8341
** RFC8342
** RFC8446
** RFC8500
* Informative References
** RFC8340


#+name: dep-babel
#+begin_src emacs-lisp :results none :exports none
  (org-babel-do-load-languages 'org-babel-load-languages '((shell . t)))
#+end_src

#+name: fetch-yang-files
#+begin_src shell :results none silent :exports none
  BASEURL=https://raw.githubusercontent.com/YangModels/yang/master
  curl -O $BASEURL/experimental/ietf-extracted-YANG-modules/ietf-isis@2019-09-09.yang
  curl -O $BASEURL/standard/ietf/RFC/ietf-routing@2016-11-04.yang
#+end_src
